tutorials/coupled/conjugateHeatSimpleFoam/conjugateCavity/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation      on;

radiationModel P1;

noRadiation
{
}

P1Coeffs
{
}

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
    a              a      [ 0 -1  0  0  0  0  0] 0.0;
    e              e      [ 0 -1  0  0  0  0  0] 0.0;
    E              E      [ 1 -1 -3  0  0  0  0] 0.0;
}

scatterModel constantScatter;

constantScatterCoeffs
{
    sigma          sigma  [ 0 -1  0  0  0  0  0] 0.1;
    C              C      [ 0  0  0  0  0  0  0] 0.0;
}

solverFreq 1;

// ************************************************************************* //
